Project/Toir/src/InformationRegisters/торо_ДанныеАСУТП/торо_ДанныеАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ДанныеАСУТП</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МеткаВремени</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НаименованиеОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДСеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СобытияИнтеграцииСАСУТП/торо_СобытияИнтеграцииСАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СобытияИнтеграцииСАСУТП</name>
  <resources>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </resources>
  <resources>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.торо_СобытияИнтеграции</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.торо_ОшибкиАСУТП</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИДСеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СозданныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СписокОповещаемыхЛиц/торо_СписокОповещаемыхЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СписокОповещаемыхЛиц</name>
  <dimensions>
    <name>ОповещаемоеЛицо</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОчередьУведомлений/торо_ОчередьУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОчередьУведомлений</name>
  <resources>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТелоПисьма</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ID_уведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособУведомления</name>
    <type>
      <types>EnumRef.торо_СпособыУведомленияПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DocumentRef.торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы</types>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ИзменениеСоставаРемонтнойБригады</types>
      <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
      <types>DocumentRef.торо_УстановкаКоэффициентовРемонтныхОсобенностей</types>
      <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_УстановкаАналоговНоменклатурыДляРемонтов</types>
      <types>DocumentRef.торо_НастройкаРегистрацииНаработкиЗависимыхОР</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ИзменениеПоложенияВСтруктуреИерархии</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ПринятиеОРКУчету</types>
      <types>DocumentRef.торо_УстановкаЦелевыхЗначенийПоказателейKPI</types>
      <types>DocumentRef.торо_КомиссионноеРассмотрение</types>
      <types>DocumentRef.торо_РегистрацияЗначенийВнешнихПоказателейKPI</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_ВыбытиеОбъектаРемонта</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ОценкаРаботыПодрядчика</types>
      <types>DocumentRef.торо_УстановкаСтоимостейКвалификаций</types>
      <types>DocumentRef.торо_УчетНаработкиОборудования</types>
      <types>DocumentRef.торо_ВводНачальныхДанных</types>
      <types>DocumentRef.торо_ПрисвоениеКвалификацийСотрудникам</types>
      <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      <types>DocumentRef.торо_УстановкаПроизвольногоЗначенияНаработки</types>
      <types>DocumentRef.торо_УстановкаМинимальногоОстаткаНоменклатуры</types>
      <types>DocumentRef.торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      <types>DocumentRef.торо_АктПриемкиОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СоответствияТеговАСУТПОбъектамТОИР/торо_СоответствияТеговАСУТПОбъектамТОИР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоответствияТеговАСУТПОбъектамТОИР</name>
  <resources>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ТипСигнала</name>
    <type>
      <types>EnumRef.торо_ТипыСигналовАСУТП</types>
    </type>
  </resources>
  <resources>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрНаработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </resources>
  <resources>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательKPI</name>
    <type>
      <types>CatalogRef.торо_ПоказателиKPI</types>
    </type>
  </resources>
  <dimensions>
    <name>НаименованиеОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СобытияИнтеграции/торо_СобытияИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СобытияИнтеграции</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_СпособыУведомленияПользователей/торо_СпособыУведомленияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СпособыУведомленияПользователей</name>
  <enumValues>
    <name>УведомлениеПоЭлектроннойПочте</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеВВидеНапоминания</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеВВидеВсплывающейПодсказки</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ВидыОперацийОтклоненияВРаботеОборудования/торо_ВидыОперацийОтклоненияВРаботеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыОперацийОтклоненияВРаботеОборудования</name>
  <enumValues>
    <name>ВидЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВидЭксплуатацииНаПериод</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ТипыСигналовАСУТП/торо_ТипыСигналовАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыСигналовАСУТП</name>
  <enumValues>
    <name>Состояние</name>
  </enumValues>
  <enumValues>
    <name>Показатель</name>
  </enumValues>
  <enumValues>
    <name>Наработка</name>
  </enumValues>
  <enumValues>
    <name>Дефект</name>
  </enumValues>
  <enumValues>
    <name>KPI</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ОшибкиАСУТП/торо_ОшибкиАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ОшибкиАСУТП</name>
  <enumValues>
    <name>Подключение</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеДанных</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеДанныхИзРегистра</name>
  </enumValues>
  <enumValues>
    <name>ГенерацияИЗаписьНовыхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеНовыхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеДанныхИзМакета</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/CommonModules/торо_ОбработкаДанныхАСУТП/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура выполняет обработку данных, полученных из АСУ ТП:
// формирование документов по правилам и почтовых уведомлений.
//
Процедура ОбработатьДанные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
	               |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса
	               |ИЗ
	               |	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
	               |ГДЕ
	               |	торо_ДанныеАСУТП.Ошибка = ЛОЖЬ
	               |	И торо_ДанныеАСУТП.Обработан = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МеткаВремени";
	
	резЗапроса = Запрос.Выполнить();
	Если резЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = резЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработатьПоСеансу(Выборка.ИДСеанса);
		СформироватьПочтовыеУведомление(Выборка.ИДСеанса);
	КонецЦикла;
	
КонецПроцедуры

// Процедура формирует почтовые уведомления по данным,
// полученным из АСУ ТП.
//
// Параметры:
//		ИДСеанса - УникальныйИдентификатор - идентификатор сеанса обмена данными с АСУ ТП.
//
Процедура СформироватьПочтовыеУведомление(ИДСеанса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_СобытияИнтеграцииСАСУТП.Ошибка КАК Ошибка
	               |ИЗ
	               |	РегистрСведений.торо_СобытияИнтеграцииСАСУТП КАК торо_СобытияИнтеграцииСАСУТП
	               |ГДЕ
	               |	торо_СобытияИнтеграцииСАСУТП.ИДСеанса = &ИДСеанса
	               |	И торо_СобытияИнтеграцииСАСУТП.ТипСобытия = &ТипСобытия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_СписокОповещаемыхЛиц.ОповещаемоеЛицо КАК ОповещаемоеЛицо
	               |ИЗ
	               |	РегистрСведений.торо_СписокОповещаемыхЛиц КАК торо_СписокОповещаемыхЛиц";
	
	Запрос.УстановитьПараметр("ИДСеанса", ИДСеанса);
	Запрос.УстановитьПараметр("ТипСобытия", Перечисления.торо_СобытияИнтеграции.Ошибка);
	
	резЗапроса = Запрос.ВыполнитьПакет();
	 
	Если резЗапроса[0].Пустой() или резЗапроса[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СписокОшибок = резЗапроса[0].Выбрать();
	СписокЛиц = резЗапроса[1].Выбрать();
	
	ТемаПисьма = "Ошибка при обмене с АСУ ТП (" + ТекущаяДата() + "). Зафиксировано " + СписокОшибок.Количество() + " ошибок.";
	ТелоПисьма = "";
	Пока СписокОшибок.Следующий() Цикл
		Если ТелоПисьма = "" Тогда
			ТелоПисьма = СписокОшибок.Ошибка + ";";
		Иначе 
			ТелоПисьма = ТелоПисьма + Символы.ПС + "===============" + Символы.ПС + СписокОшибок.Ошибка + ";";
		КонецЕсли;
	КонецЦикла;
	
	Пока СписокЛиц.следующий() Цикл
		мз = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
		мз.Пользователь = СписокЛиц.ОповещаемоеЛицо;
		мз.ID_уведомления = Новый УникальныйИдентификатор;
		мз.СпособУведомления = Перечисления.торо_СпособыУведомленияПользователей.УведомлениеПоЭлектроннойПочте;
		мз.ТемаПисьма = ТемаПисьма;
		мз.ТелоПисьма = ТелоПисьма;
		мз.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСигналНаработка(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия)
	
	ДокОб = Документы.торо_УчетНаработкиОборудования.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = ТекущаяДата();
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	
	нс = докОб.НаработкаОбъектов.Добавить();
	нс.Объект = выборка.ОР;
	нс.Показатель = Выборка.ПараметрНаработки;
	нс.Наработка = Выборка.Значение;
	нс.ДатаРаботыПо = Выборка.Дата;
	
	ЗначениеНаработки = торо_РаботаСНаработкой.ПолучитьТекущееЗначениеНаработки(нс.Объект, нс.Показатель, Неопределено);
	Если ЗначениеЗаполнено(ЗначениеНаработки) Тогда
		нс.ДатаРаботыС = ЗначениеНаработки.НаработаноДата;
		нс.СтароеЗначение = ЗначениеНаработки.НаработаноЗначение;
	КонецЕсли;
	нс.НовоеЗначение = нс.СтароеЗначение + нс.Наработка;
	нс.Иерархия = ОсновнаяИерархия;
	
	докОб.Записать(РежимЗаписиДокумента.Запись);
	докОб.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ОбработатьСигналПоказатель(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, СоздаватьДефекты)
	ДокОб = Документы.торо_УчетКонтролируемыхПоказателей.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = Выборка.МеткаВремени;
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	
	нс = ДокОб.Показатели.Добавить();
	ЗаполнитьЗначенияСвойств(нс, Выборка);
	нс.ОбъектРемонта = Выборка.ОР;
	нс.ДатаКонтроля = Выборка.Дата;
	
	докОб.Записать(РежимЗаписиДокумента.Запись);
	масСозданныхДокументов.Добавить(докОб.Ссылка);
	Если сооДокументыИИсхДанные[докОб.Ссылка] = Неопределено Тогда
		сооДокументыИИсхДанные.Вставить(докОб.Ссылка, выборка);
	КонецЕсли;

	Если СоздаватьДефекты Тогда
		ДокументыВДКСозданию = новый СписокЗначений;
		торо_РемонтыПоСостоянию.СформироватьУведомленияИДефекты(ДокОб, ДокументыВДКСозданию);
		
		Для каждого текДок из ДокументыВДКСозданию Цикл
			
			ОбработатьСигналДефект(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные);
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьСигналСостояние(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные)
	докОб = Документы.торо_СостоянияОбъектовРемонта.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = ТекущаяДата();
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	докОб.ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации;
	
	нс = докОб.ОбъектыРемонта.Добавить();
	нс.ДатаОкончания = Выборка.Дата;
	нс.ОбъектРемонта = Выборка.ОР;
	нс.ВидЭксплуатации = Выборка.Состояние;
	нс.ПричинаПростоя = Выборка.ПричинаПростоя;
	
	докОб.Записать(РежимЗаписиДокумента.Запись);
	масСозданныхДокументов.Добавить(докОб.Ссылка);
	Если сооДокументыИИсхДанные[докОб.Ссылка] = Неопределено Тогда
		сооДокументыИИсхДанные.Вставить(докОб.Ссылка, выборка);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьСигналДефект(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные)
	докОб = Документы.торо_ВыявленныеДефекты.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = ТекущаяДата();
	докОб.ДатаОбнаружения = Выборка.дата;
	докОб.ДефектВыявленВПроцессе = Справочники.торо_УсловияВыявленияДефекта.ПоДаннымАСУТП;
	
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	
	нс = докОб.СписокДефектов.Добавить();
	ЗаполнитьЗначенияСвойств(нс, Выборка);
	нс.ОбъектРемонта = Выборка.ОР;
	нс.ОтказавшийЭлемент = Выборка.ОР;
	Если Выборка.ПричиныВозникновенияДефекта <> Неопределено И Выборка.ПричиныВозникновенияДефекта.Количество() > 0 Тогда
		нс.ДефектПричина = Выборка.ПричиныВозникновенияДефекта[0].Причина;
	КонецЕсли;
	
	докОб.Записать(РежимЗаписиДокумента.Запись);
	масСозданныхДокументов.Добавить(докОб.Ссылка);
	Если сооДокументыИИсхДанные[докОб.Ссылка] = Неопределено Тогда
		сооДокументыИИсхДанные.Вставить(докОб.Ссылка, выборка);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьСигналKPI(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные)
	докОб = Документы.торо_РегистрацияЗначенийВнешнихПоказателейKPI.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(докОб, Выборка);
	докОб.Дата = ТекущаяДата();
	докОб.Комментарий = НСтр("ru='Документ сформирован автоматически при загрузке данных АСУ ТП.'");
	
	нс = докОб.ЗначенияПоказателей.Добавить();
	нс.Показатель = Выборка.ПоказательКПИ;
	нс.Период = Выборка.Дата;
	нс.Значение = Выборка.Значение;
	нс.Подразделение = Выборка.Подразделение;
	нс.ОбъектРемонта = Выборка.ОР;
	
	докОб.Записать(РежимЗаписиДокумента.Запись);
	масСозданныхДокументов.Добавить(докОб.Ссылка);
	Если сооДокументыИИсхДанные[докОб.Ссылка] = Неопределено Тогда
		сооДокументыИИсхДанные.Вставить(докОб.Ссылка, выборка);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьПоСеансу(ИДСеанса, НомерПопытки = 1)
	
	Если НомерПопытки > 100 Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнаяИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	УдалятьОбработанныеЗаписи = Константы.торо_УдалятьОбработанныеЗаписиАСУТП.Получить();
	СоздаватьДефекты = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРемонтыПоСостоянию");
	СоздаватьДокументыКПИ = ПолучитьФункциональнуюОпцию("торо_ПоказыватьПодсистемуKPI");
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ДанныеАСУТП.Тег КАК Тег,
	               |	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
	               |	торо_ДанныеАСУТП.Дата КАК Дата,
	               |	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
	               |	торо_ДанныеАСУТП.Значение КАК Значение,
	               |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
	               |	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
	               |	торо_ДанныеАСУТП.Подключение КАК Подключение
	               |ПОМЕСТИТЬ табАСУТП
	               |ИЗ
	               |	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
	               |ГДЕ
	               |	торо_ДанныеАСУТП.ИДСеанса = &ИДСеанса
	               |	И торо_ДанныеАСУТП.Ошибка = ЛОЖЬ
	               |	И торо_ДанныеАСУТП.Обработан = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ДанныеАСУТП.Тег КАК Тег,
	               |	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
	               |	торо_ДанныеАСУТП.Дата КАК Дата,
	               |	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
	               |	торо_ДанныеАСУТП.Значение КАК Значение,
	               |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
	               |	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
	               |	торо_ДанныеАСУТП.Подключение КАК Подключение,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.ОбъектРемонта КАК ОР,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.ТипСигнала КАК ТипСигнала,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.Показатель КАК Показатель,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.ПараметрНаработки КАК ПараметрНаработки,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.Состояние КАК Состояние,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.Ответственный КАК Ответственный,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.Подразделение КАК Подразделение,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.Организация КАК Организация,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.ВидДефекта КАК ТиповойДефект,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.ПричинаПростоя КАК ПричинаПростоя,
	               |	торо_СоответствияТеговАСУТПОбъектамТОИР.ПоказательKPI КАК ПоказательКПИ
	               |ПОМЕСТИТЬ ИсхДанные
	               |ИЗ
	               |	табАСУТП КАК торо_ДанныеАСУТП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоответствияТеговАСУТПОбъектамТОИР КАК торо_СоответствияТеговАСУТПОбъектамТОИР
	               |		ПО торо_ДанныеАСУТП.Подключение = торо_СоответствияТеговАСУТПОбъектамТОИР.Подключение
	               |			И торо_ДанныеАСУТП.Тег = торо_СоответствияТеговАСУТПОбъектамТОИР.Тег
	               |			И торо_ДанныеАСУТП.НаименованиеОР = торо_СоответствияТеговАСУТПОбъектамТОИР.НаименованиеОР
	               |			И (торо_СоответствияТеговАСУТПОбъектамТОИР.Отключить = ЛОЖЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИсхДанные.Тег КАК Тег,
	               |	ИсхДанные.НаименованиеОР КАК НаименованиеОР,
	               |	ИсхДанные.Дата КАК Дата,
	               |	ИсхДанные.МеткаВремени КАК МеткаВремени,
	               |	ИсхДанные.Значение КАК Значение,
	               |	ИсхДанные.ОР КАК ОР,
	               |	ИсхДанные.ТипСигнала КАК ТипСигнала,
	               |	ИсхДанные.Показатель КАК Показатель,
	               |	ИсхДанные.ПараметрНаработки КАК ПараметрНаработки,
	               |	ИсхДанные.Состояние КАК Состояние,
	               |	ИсхДанные.Ответственный КАК Ответственный,
	               |	ИсхДанные.Подразделение КАК Подразделение,
	               |	ИсхДанные.Организация КАК Организация,
	               |	ИсхДанные.ПричинаПростоя КАК ПричинаПростоя,
	               |	ИсхДанные.ПоказательКПИ КАК ПоказательКПИ,
	               |	ИсхДанные.ИДСеанса КАК ИДСеанса,
	               |	ИсхДанные.ИДЗаписи КАК ИДЗаписи,
	               |	ИсхДанные.Подключение КАК Подключение,
	               |	ВЫБОР
	               |		КОГДА ИсхДанные.ОР ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ИСТИНА КАК Обработан,
	               |	ИсхДанные.ТиповойДефект КАК ТиповойДефект,
	               |	торо_ТиповыеДефектыОборудования.ВидДефекта КАК ВидДефекта,
	               |	торо_ТиповыеДефектыОборудования.КритичностьДефекта КАК КритичностьДефекта,
	               |	торо_ТиповыеДефектыОборудования.ОписаниеДефекта КАК ДефектОписание,
	               |	торо_ТиповыеДефектыОборудования.ПоследствиеДефекта КАК ПоследствияДефекта,
	               |	торо_ТиповыеДефектыОборудования.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	               |	торо_ТиповыеДефектыОборудования.ПричиныВозникновенияДефекта.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		Причина КАК Причина
	               |	) КАК ПричиныВозникновенияДефекта
	               |ИЗ
	               |	ИсхДанные КАК ИсхДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеДефектыОборудования КАК торо_ТиповыеДефектыОборудования
	               |		ПО ИсхДанные.ТиповойДефект = торо_ТиповыеДефектыОборудования.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ДанныеАСУТП.Тег КАК Тег,
	               |	торо_ДанныеАСУТП.НаименованиеОР КАК НаименованиеОР,
	               |	торо_ДанныеАСУТП.Дата КАК Дата,
	               |	торо_ДанныеАСУТП.МеткаВремени КАК МеткаВремени,
	               |	торо_ДанныеАСУТП.Значение КАК Значение,
	               |	торо_ДанныеАСУТП.ИДСеанса КАК ИДСеанса,
	               |	торо_ДанныеАСУТП.ИДЗаписи КАК ИДЗаписи,
	               |	торо_ДанныеАСУТП.Подключение КАК Подключение
	               |ИЗ
	               |	РегистрСведений.торо_ДанныеАСУТП КАК торо_ДанныеАСУТП
	               |ГДЕ
	               |	торо_ДанныеАСУТП.ИДСеанса = &ИДСеанса
	               |	И торо_ДанныеАСУТП.Ошибка = ИСТИНА";
	
	Запрос.УстановитьПараметр("ИДСеанса", ИДСеанса);
	
	резЗапроса = Запрос.ВыполнитьПакет();
	ИсхДанные = резЗапроса[2];
	списокОшибок = резЗапроса[3].Выгрузить();
	
	масОшибок = Новый Массив;
	масСозданныхДокументов = Новый Массив;
	сооДокументыИИсхДанные = Новый Соответствие;
	сооОбработчики = торо_ОбработкаДанныхАСУТППереопределяемый.ПолучитьСписокПереопределяемыхФункцийОбработчиков();
		
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		Если НЕ ИсхДанные.Пустой() Тогда
			ВыборкаТЗ = ИсхДанные.Выгрузить();
			Для каждого Выборка из ВыборкаТЗ Цикл
				
				Если Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Наработка Тогда
					Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.Наработка] = Ложь Тогда
						ОбработатьСигналНаработка(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
					Иначе
						торо_ОбработкаДанныхАСУТППереопределяемый.Наработка(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
					КонецЕсли;
				ИначеЕсли Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Показатель Тогда
					Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.Показатель] = Ложь Тогда
						ОбработатьСигналПоказатель(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, СоздаватьДефекты);
					Иначе
						торо_ОбработкаДанныхАСУТППереопределяемый.Показатель(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
					КонецЕсли;
				ИначеЕсли Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Состояние Тогда
					Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.Состояние] = Ложь Тогда
						ОбработатьСигналСостояние(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные);
					Иначе
						торо_ОбработкаДанныхАСУТППереопределяемый.СостояниеОР(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
					КонецЕсли;
				ИначеЕсли Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.Дефект Тогда
					Если СоздаватьДефекты Тогда
						Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.Дефект] = Ложь Тогда
							ОбработатьСигналДефект(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные);
						Иначе
							торо_ОбработкаДанныхАСУТППереопределяемый.Дефект(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Выборка.ТипСигнала = Перечисления.торо_ТипыСигналовАСУТП.KPI Тогда
					Если СоздаватьДокументыКПИ Тогда
						Если сооОбработчики[Перечисления.торо_ТипыСигналовАСУТП.KPI] = Ложь Тогда
							ОбработатьСигналKPI(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные);
						Иначе
							торо_ОбработкаДанныхАСУТППереопределяемый.KPI(Выборка, масСозданныхДокументов, сооДокументыИИсхДанные, ОсновнаяИерархия);
						КонецЕсли;
					КонецЕсли;
				Иначе 
					ВызватьИсключение НСтр("ru='Не распознан тип сигнала.'");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Исключение
		ОшибкаТранзакции = Истина;
		ОтменитьТранзакцию();
		ЗарегистрироватьОшибкуИнтеграции(Выборка, 
			Перечисления.торо_ОшибкиАСУТП.ГенерацияИЗаписьНовыхДокументов,
			ОписаниеОшибки());
	КонецПопытки;	
	
	Если ОшибкаТранзакции Тогда
		мз = РегистрыСведений.торо_ДанныеАСУТП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(мз, Выборка);
		мз.Ошибка = Истина;
		мз.Записать();
		
		ОбработатьПоСеансу(ИДСеанса, НомерПопытки+1);
	Иначе
		нз = РегистрыСведений.торо_ДанныеАСУТП.СоздатьНаборЗаписей();
		нз.Отбор.ИДСеанса.установить(ИДСеанса);
		
		Если УдалятьОбработанныеЗаписи = Истина Тогда 
			нз.Загрузить(списокОшибок);
		Иначе
			нз.Прочитать();
			Для каждого текЗапись из нз цикл
				текЗапись.Обработан = Истина;
			КонецЦикла;
		КонецЕсли;
		нз.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Для каждого текДок из масСозданныхДокументов цикл
			попытка
				докОб = текДок.ПолучитьОбъект();
				докОб.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Исключение'"), УровеньЖурналаРегистрации.Предупреждение,,,ОписаниеОшибки);
				ЗарегистрироватьОшибкуИнтеграции(сооДокументыИИсхДанные[текДок], Перечисления.торо_ОшибкиАСУТП.ПроведениеНовыхДокументов, ОписаниеОшибки, текДок);
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибкуИнтеграции(ТекИсточник, Этап, ОписаниеОшибки, СсылкаДок = Неопределено)
	
	ТекстОшибки = "";
	Если Этап = Перечисления.торо_ОшибкиАСУТП.ЧтениеДанныхИзРегистра Тогда
		мз = РегистрыСведений.торо_СобытияИнтеграцииСАСУТП.СоздатьМенеджерЗаписи();
		мз.Подключение = ТекИсточник.Подключение;
		мз.Дата = ТекущаяДата();
		мз.ИДСеанса = ТекИсточник.ИДСеанса;
		мз.ТипОшибки = Этап;
		мз.ТипСобытия = Перечисления.торо_СобытияИнтеграции.Ошибка;
		ТекстОшибки = "ОписаниеОшибки: " + ОписаниеОшибки;
		мз.Ошибка = ТекстОшибки;
		мз.Записать();
	ИначеЕсли Этап = Перечисления.торо_ОшибкиАСУТП.ГенерацияИЗаписьНовыхДокументов Тогда
		мз = РегистрыСведений.торо_СобытияИнтеграцииСАСУТП.СоздатьМенеджерЗаписи();
		мз.Подключение = ТекИсточник.Подключение;
		мз.Дата = ТекущаяДата();
		мз.ИДСеанса = ТекИсточник.ИДСеанса;
		мз.ИДЗаписи = ТекИсточник.ИДЗаписи;
		мз.ТипОшибки = Этап;
		мз.ТипСобытия = Перечисления.торо_СобытияИнтеграции.Ошибка;
		ТекстОшибки = "Тег: " + ТекИсточник.Тег + Символы.ПС
			+ "НаименованиеОР: " + ТекИсточник.НаименованиеОР + Символы.ПС
			+ "Дата: " + ТекИсточник.Дата + Символы.ПС
			+ "МеткаВремени: " + ТекИсточник.МеткаВремени + Символы.ПС
			+ "Значение: " + ТекИсточник.Значение + Символы.ПС
			+ "Ошибка: " + ТекИсточник.Ошибка + Символы.ПС
			+ "ОР: " + ТекИсточник.ОР + Символы.ПС
			+ "ТипСигнала: " + ТекИсточник.ТипСигнала + Символы.ПС
			+ "Показатель: " + ТекИсточник.Показатель + Символы.ПС
			+ "ПараметрНаработки: " + ТекИсточник.ПараметрНаработки + Символы.ПС
			+ "Состояние: " + ТекИсточник.Состояние + Символы.ПС
			+ "Ответственный: " + ТекИсточник.Ответственный + Символы.ПС
			+ "Подразделение: " + ТекИсточник.Подразделение + Символы.ПС
			+ "Организация: " + ТекИсточник.Организация + Символы.ПС
			+ "ВидДефекта: " + ТекИсточник.ВидДефекта + Символы.ПС
			+ "ПричинаПростоя: " + ТекИсточник.ПричинаПростоя + Символы.ПС
			+ "ОписаниеОшибки: " + ОписаниеОшибки;
		мз.Ошибка = ТекстОшибки;
		мз.Записать();
		
	ИначеЕсли Этап = Перечисления.торо_ОшибкиАСУТП.ПроведениеНовыхДокументов Тогда
		мз = РегистрыСведений.торо_СобытияИнтеграцииСАСУТП.СоздатьМенеджерЗаписи();
		мз.Подключение = ТекИсточник.Подключение;
		мз.Дата = ТекущаяДата();
		мз.ИДСеанса = ТекИсточник.ИДСеанса;
		мз.ИДЗаписи = ТекИсточник.ИДЗаписи;
		мз.ТипОшибки = Этап;
		мз.ТипСобытия = Перечисления.торо_СобытияИнтеграции.Ошибка;
		мз.СозданныйДокумент = СсылкаДок;
		
		ТекстОшибки = "Документ: " + СсылкаДок + Символы.ПС
			+ "Тег: " + ТекИсточник.Тег + Символы.ПС
			+ "НаименованиеОР: " + ТекИсточник.НаименованиеОР + Символы.ПС
			+ "Дата: " + ТекИсточник.Дата + Символы.ПС
			+ "МеткаВремени: " + ТекИсточник.МеткаВремени + Символы.ПС
			+ "Значение: " + ТекИсточник.Значение + Символы.ПС
			+ "Ошибка: " + ТекИсточник.Ошибка + Символы.ПС
			+ "ОР: " + ТекИсточник.ОР + Символы.ПС
			+ "ТипСигнала: " + ТекИсточник.ТипСигнала + Символы.ПС
			+ "Показатель: " + ТекИсточник.Показатель + Символы.ПС
			+ "ПараметрНаработки: " + ТекИсточник.ПараметрНаработки + Символы.ПС
			+ "Состояние: " + ТекИсточник.Состояние + Символы.ПС
			+ "Ответственный: " + ТекИсточник.Ответственный + Символы.ПС
			+ "Подразделение: " + ТекИсточник.Подразделение + Символы.ПС
			+ "Организация: " + ТекИсточник.Организация + Символы.ПС
			+ "ВидДефекта: " + ТекИсточник.ВидДефекта + Символы.ПС
			+ "ПричинаПростоя: " + ТекИсточник.ПричинаПростоя + Символы.ПС
			+ "ОписаниеОшибки: " + ОписаниеОшибки;
		мз.Ошибка = ТекстОшибки;
		мз.Записать();
	Иначе 
		мз = РегистрыСведений.торо_СобытияИнтеграцииСАСУТП.СоздатьМенеджерЗаписи();
		мз.Подключение = ТекИсточник.Подключение;
		мз.Дата = ТекущаяДата();
		мз.ИДСеанса = ТекИсточник.ИДСеанса;
		мз.ТипОшибки = Этап;
		мз.ТипСобытия = Перечисления.торо_СобытияИнтеграции.Ошибка;
		ТекстОшибки = "Неопознанный этап интеграции: " + Этап;
		мз.Ошибка = ТекстОшибки;
		мз.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
